Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh543-v2.tmx
Source language: bo
Languages: en

source: རེ་ཞིག་དང་པོ་ཆོ་འཕྲུལ་གྱི་ཟླ་ཕྱེད་དམ་དཔྱིད་ཟླ་འབྲིང་པོའམ་དཔྱིད་ཟླ་ཐ་ཆུངས་སམ་ཟླ་བ་ཡར་ངོ་འམ། ཉིན་ཞག་དགེ་བ་དང་གཟའ་བཟང་པོ་བལྟས་ཏེརྒྱུ་སྐར་བཟང་པོ་དང་ལྡན་པ་ཡར་ངོའི་ཚེས་གཅིག་དང་། ཟླ་བ་ཉ་བའམ་དུས་གཞན་ལ་དབྱར་གྱི་དུས་སྤངས་ལ། སྔ་དྲོ་ས་བྱིན་གྱིས་བརླབ་པར་བྱ་སྟེ།
en: “To start, on a bright fortnight of the month of Caitra or Vaiśākha, which is a ‘fortnight of miracles,’ on an auspicious day, after ascertaining the favorable positions of the planets and when the moon is in the right constellation, either on the first day of the bright fortnight or during the full moon, or at some other time, other than the rainy months, one should consecrate the ground in the morning. {2.120}

source: གང་དུ་གྲོང་ཁྱེར་ཆེན་པོ་ལ་བརྟེན་པའམ། དཀྱིལ་འཁོར་གྱི་སློབ་དཔོན་རང་ཉིད་འདུག་པར་བྱའོ། །
en: “One should take one’s quarters in a city, or where oneself or the maṇḍala master lives,

source: རྒྱ་མཚོ་ཆེན་པོར་འཇུག་པའི་གནས་སམ། རྒྱ་མཚོའི་ངོགས་དང་ཉེ་བའི་གྲོང་ཁྱེར་ཆེན་པོའི་བྱང་ཤར་གྱི་ཕྱོགས་སུ་ཧ་ཅང་ཡང་མི་རིང་ཧ་ཅང་ཡང་མི་ཉེ་བར་དཀྱིལ་འཁོར་གྱི་སློབ་དཔོན་སོང་སྟེ་
en: or by a river that flows into the ocean, or near an ocean shore that is to the northeast of the city, neither too near nor too far from where the maṇḍala master lives.

source: ལོ་མའི་སྤྱིལ་བུ་བྱས་པ་ལ་ཞག་བདུན་ནམ་ཟླ་བ་ཕྱེད་ཀྱི་བར་དུ་གཅིག་པུ་རབ་ཏུ་གནས་པར་བྱ་སྟེ
en: One should build there a hut of leaves and stay there alone for a period of a week or two. {2.121}

source: གང་གནས་དེ་དག་ཏུའང་གཙང་མའི་ས་ཕྱོགས་རྡོ་བ་མེད་པ། གྱོ་མོ་དང་ཐལ་བ་དང་སོལ་བ་དང་། །ཕུབ་མ་དང་རུས་པ་སྤངས་པ་ཤིན་ཏུ་གཙང་བ་ཤིན་ཏུ་ཡོངས་སུ་སྦྱངས་པའི་ས་ཕྱོགས་སུ་སྲོག་ཆགས་མེད་པའི་ཆུ་ལ་བའི་རྣམ་ལྔའམ། ཙནྡན་དང་ག་པུར་དང་།
en: “There, one should choose a place on the ground that is clean, covers a square area measuring sixteen or twelve cubits across, and is free from stones, gravel, ash, coals, chaff, eggshells, and bones. Having cleaned and prepared this place well, one should sprinkle it using water that is free of living organisms and mixed with the five products of the cow, or water mixed with sandalwood, camphor, and saffron.

source: གུར་གུམ་གྱི་ཆུས་བསྲེས་པ་ཁྲོ་བོ་གཤིན་རྗེ་གཤེད་ཀྱི་སྔགས་སྟོང་རྩ་བརྒྱད་བཟླས་ཏེ། གཙུག་ཕུད་ལྔའི་ཕྱག་རྒྱ་ཆེན་པོ་དང་ལྡན་པས་ས་ཕྱོགས་དེར་ཕྱོགས་བཞི་དང་སྟེང་དང་། འོག་དང་ཐད་ཀ་དང་ཕྱོགས་མཚམས་ཐམས་ཅད་དུ་བསང་གཏོར་བྱའོ། །
en: This water should be incanted one thousand and eight times with Yamāntaka, the Lord of Wrath , recited while forming the great five-crested mudrā. One should throw the water in the four cardinal and four intermediate directions, upward, downward, horizontally, and all around the area. {2.122}

source: དེ་ནས་ཕྱོགས་དེར་ཀུན་ནས་གྲུ་བཞིར་ཁྲུ་བཅུ་དྲུག་གམ་ཁྲུ་བཅུ་གཉིས་སམ་ཁྲུ་བརྒྱད་པ་བྱ་སྟེ།
en: “This square area on the ground with four equal sides may be sixteen, twelve, or eight cubits across—

source: དེ་ལ་ཆེན་པོ་ནི་ཁྲུ་བཅུ་དྲུག་པའོ། །
en: sixteen cubits is the largest size,

source: འབྲིང་ནི་ཁྲུ་བཅུ་གཉིས་པའོ། །
en: twelve the medium size,

source: ཆུང་ངུ་ནི་ཁྲུ་བརྒྱད་པའོ། །
en: and eight cubits is the smallest.

source: དཀྱིལ་འཁོར་འདི་ནི་རྣམ་པ་གསུམ། །ཐམས་ཅད་གཟིགས་པས་གསུངས་པ་ཡིན། །
en: Such a maṇḍala has been proclaimed by the all-knowing ones to be of three kinds:

source: རྒྱལ་པོ་འདོད་པས་ཆེན་པོ་སྟེ། །འབྲིང་ནི་ལོངས་སྤྱོད་འཕེལ་བྱེད་པ། །ཆུང་ངུའི་དམ་ཚིག་ཡང་དག་སྲུང་། །ལས་རྣམས་ཀུན་བྱེད་ཞི་བ་ཡིན། །
en: the largest is for those who desire kingship, the medium serves for bringing enjoyments, and the smallest, which merely safeguards the samaya, can be used in all activities as it is auspicious. {2.123}

source: དེ་དག་ལས་ཡིད་ལ་གང་འདོད་པའི་དཀྱིལ་འཁོར་བྲི་བ་ནི་དེ་ལ་ས་ཕྱོགས་དེར་ཁྲུ་དོ་ཙམ་བརྐོས་ལ།
en: “One should thus draw the maṇḍala in the size that one desires, and excavate its area to the depth of two cubits.

source: དེར་རྡོ་བ་དང་སོལ་བ་དང་ཐལ་བ་དང་རུས་པ་དང་སྐྲ་ལ་སོགས་པ་དང་། སྲོག་ཆགས་ཀྱི་རིགས་རྣམ་པ་སྣ་ཚོགས་གལ་ཏེ་མཐོང་ནསའི་ཕྱོགས་གཞན་དུ་བརྐོ་བ་བྱས་ན་གནོད་པ་མེད་པ་དང་འཚེ་བ་མེད་པར་འགྱུར་རོ། །
en: If one sees stones, coals, ashes, bones, hairs, or any other products of living beings, one should dig at another location. It ought to be a place where one will not be obstructed or disturbed.

source: རི་བོའི་རྩེ་མོ་དང་ཆུ་བོའི་ངོགས་དང་རྒྱ་མཚོའི་འགྲམ་དང་ཆུ་བོ་ཆེན་པོའི་ངོགས་སུ་བྱེ་མའི་ཕུང་པོ་ཆེན་པོ་རྣམས་འབད་པས།
en: If such a place is difficult to find, one should go to a mountaintop, or dig the layers of sand, or other soil, on the beach of an estuary, the sea, or a large river.

source: ཤིན་ཏུ་སོ་སོར་བརྟགས་ཏེ། ཤིན་ཏུ་གཙང་བ་དང་སྲོག་ཆགས་མེད་པར་བྱས་ལ་བྲི་བར་བྱའོ། །
en: After examining the place with great care, cleaning it, and removing all living creatures, one should draw the outline. {2.124}

source: ས་ཕྱོགས་དེ་ཡང་སྲོག་ཆགས་མེད་པའི་ཆུ་ལ་བའི་རྣམ་ལྔ་བསྲེས་ཏེ། ཆུ་བོའི་ཀླུང་གིས་གཙང་མའམ། གྲོག་མཁར་གྱི་ས་གང་དུ་སྲོག་ཆགས་མེད་པའི་ས་དེས་དགང་བར་བྱའོ། །
en: “One should further smear this entire area with the five products of the cow mixed with water uncontaminated by living organisms and fill it with unpolluted clay from a riverbank or an anthill, making sure that the clay does not contain living creatures.

source: བཀང་ནས་ཀྱང་ལེགས་པར་བརྡུངས་ཏེ་ཀུན་ནས་མཉམ་པར་བྱས་ལ་དཀྱིལ་འཁོར་རྣམ་པ་གསུམ་གང་འདོད་པར་བྱའོ། །
en: Once the area has been filled and well beaten, with an even surface, one should create the threefold maṇḍala as required, with a well-beaten and even surface all over.

source: སེང་ལྡེང་གི་ཕུར་བ་བཞི་ལ་ཁྲོ་བོའི་རྒྱལ་པོའི་སྔགས་ལན་བདུན་བཟླ་ཞིང་ཕྱོགས་བཞིར་གདབ་བོ། །ཚོན་སྣ་ལྔའི་སྐུད་པ་ལ་ཁྲོ་བོའི་སྙིང་པོ་ལན་བདུན་བཟླས་པ་བྱས་ཏེདཀྱིལ་འཁོར་ཕྱོགས་བཞི་ཀུན་ནས་བསྐོར་བར་བྱའོ། །
en: In its four corners one should plant four stakes made of cutch wood, incanting them seven times with the Lord of Wrath. Then, having likewise incanted a five-colored thread seven times with the heart mantra of the Lord of Wrath , one should completely enclose with it the maṇḍala, tracing its four-sided shape. {2.125}

source: དེ་བཞིན་དུ་དབུས་ཀྱི་གནས་སུ་ནང་དུ་ཡང་ཟུར་བཞིར་བྱའོ། །
en: “One should trace in the same way a four-sided shape delimiting the intermediate area and another one delimiting the inner area.

source: དབུས་ན་གནས་པའི་དཀྱིལ་འཁོར་གྱི་སློབ་དཔོན་གྱིས་རང་གི་རིག་པ་རྩ་བའི་སྔགས་སྟོང་རྩ་བརྒྱད་བཟླ་བར་བྱའོ། །
en: The maṇḍala master, standing in the intermediate area, should recite the root mantra of his own vidyā one thousand and eight times.

source: གཙུག་ཕུད་ལྔའི་ཕྱག་རྒྱ་ཆེན་པོ་བཅིངས་ནས་རྩ་བའི་སྔགས་ཀྱིས་གྲོགས་པོ་དང་། བདག་ཉིད་བསྲུང་བར་བྱས་ལ།
en: By forming the great five-crested mudrā while reciting the root mantra the master will afford protection for his assistants and himself.

source: སྔགས་ཟློ་བཞིན་དུ་དཀྱིལ་འཁོར་གྱི་ཕྱི་རོལ་ཏུ་བྱུང་སྟེ།
en: After reciting, he should step outside and circumambulate the maṇḍala clockwise.

source: དཀྱིལ་འཁོར་དེ་ལ་གཡས་སུ་བསྐོར་བ་བྱས་ནས་ཁ་ཤར་ཕྱོགས་སུ་བལྟས་ཏེ། ཀུ་ཤའི་སྟན་ལ་འདུག་པར་བྱའོ། །
en: Then, facing east, he should sit on a bundle of kuśa grass and contemplate all the buddhas and bodhisattvas.

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཡིད་ལ་བྱས་ཏེ། དཀྱིལ་འཁོར་དེའི་གྲུ་བཞི་ཀུན་དུ་ཀུ་ཤས་བསྐོར་ཞིང་དགྲམ་པར་བྱའོ། །
en: Then, he should completely surround the maṇḍala with kuśa grass, tracing its quadrangular shape.

source: དེ་ཉིད་ཀྱི་ཕྱི་རོལ་དུ་ཡང་བ་རྣམས་ཞག་གཅིག་གནས་པས་བསྙལ་ཞིང་དབྱུང་བར་བྱའོ། །
en: On the outside of it, he should keep two cows for one night without food and then have them led away. {2.126}

source: དེ་ལ་དཀྱིལ་འཁོར་གྱི་སློབ་དཔོན་གྱིས་སྔོན་དུ་བྱ་བ་རྣམས་བྱས་ནས་རང་གི་རྒྱུད་ཀྱི་སྔགས་ལ་མཁས་པ་དང་། སེམས་ཅན་གྱི་དོན་གྱི་ཐབས་ཀྱི་ཕྱིར་ཐེག་པ་ཆེན་པོ་ལ་མོས་པ་དང་། ཞག་གཅིག་སྨྱུང་བར་བྱས་པ་དང་གྲོགས་བཟང་པོ་དང་ལྡན་པ་དང་། བསྟན་བཅོས་སྣ་ཚོགས་ཀྱི་ལས་མཐོང་བས། ཚོན་སྣ་ལྔའི་ཕྱེ་མ་ཞིབ་མོ་ཤིན་ཏུ་གསལ་ཞིང་ལེགས་པར་སྦྱར་བར་བྱས་ལ།
en: “The maṇḍala master, who has completed the preparatory rites, is skilled in the art of mantra in his tantric tradition, is fully intent on the Mahāyāna goal of benefiting sentient beings through skillful means, and has fasted for one night, should prepare, with help from his able assistants and following the prescribed procedure as gleaned from scientific treatises ( śāstra ), five-colored powder, finely ground, sparkling, and well refined.

source: ཡི་གེ་དྲུག་པའི་སྙིང་པོ་མངོན་པར་བཟླས་པའི་ཕྱེ་མ་དཀྱིལ་འཁོར་གྱི་དབུས་སུ་གཞག་པར་བྱའོ། །
en: Having incanted it with the six-syllable heart mantra, he should place it in the center of the maṇḍala. {2.127}

source: ཕྱི་རོལ་དུ་ཡང་རྒྱལ་མཚན་དང་བ་དན་བསྒྲེང་བ་དང་རྟ་བབས་བཞིས་བརྒྱན་པ་ཆུ་ཤིང་འབྲས་བུའི་ཚོགས་ཀྱིས་གཡུར་ཟ་བ་དང་རྔ་བོ་ཆེ་དང་རྫ་རྔ་བརྡུང་བ་དང་དུང་གི་སྒྲ་དང་དགའ་བ་དང་། བཀྲ་ཤིས་པའི་སྒྲ་སྒྲོགས་པ་དག་བྱའོ། །
en: “On the outside, he should adorn the area with raised banners and flags and four gateways. Upon supports of plantain posts he should hang clusters of fruits and have the area resound with kettledrums, tambourines, and the sounds of conchs and lutes.

source: ཟུར་བཞི་ནས་ཆོས་མཉན་པ་དག་ལ་བཤད་པར་བྱའོ། །ཕྱོགས་བཞིར་ཐེག་པ་ཆེན་པོའི་མདོ་སྡེ་བཀླག་པར་བྱ་བ་ལ་འདི་ལྟ་སྟེ།
en: He should have others recite texts of the Mahāyāna sūtras, with their exalted words, containing Dharma teachings suitable for the fourfold assembly. They should be recited in the four quarters as follows: {2.128}

source: བཅོམ་ལྡན་འདས་ཡུམ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལྷོ་ཕྱོགས་སུ་བཀླག་པར་བྱའོ། །
en: “The blessed Prajñāpāramitā should be read in the south,

source: འཕགས་པ་ཟླ་བའི་སྒྲོན་མའི་ཏིང་ངེ་འཛིན་ནུབ་ཕྱོགས་སུ་བཀླག་པར་བྱའོ། །
en: the noble Candra­pradīpa­samādhi in the west,

source: འཕགས་པ་སྡོང་པོས་བརྒྱན་པ་བྱང་ཕྱོགས་སུ་བཀླག་པར་བྱའོ། །
en: the noble Gaṇḍavyūha in the north,

source: འཕགས་པ་གསེར་འོད་དམ་པའི་མདོ་སྡེ་ཤར་ཕྱོགས་སུ་བཀླག་པར་བྱའོ། །
en: and the noble Suvarṇa­prabhāsottama­sūtra in the eastern direction.

source: གླེགས་བམ་དག་མེད་ན་མདོ་སྡེ་བཞི་པོ་ཤེས་པའི་གང་ཟག་ཆོས་འཆད་པ་པོ་ལ་ཆོས་མཉན་པའི་ཕྱིར་བསྐུལ་བར་བྱའོ། །
en: If the texts are not available, the master should instruct four Dharma reciters, learned in these four sūtras, to recite them accordingly.

source: དེ་ནས་དཀྱིལ་འཁོར་གྱི་སློབ་དཔོན་ལངས་ནས་ཙནྡན་དང་ག་པུར་དང་གུར་གུམ་བསྲེས་པའི་མེ་ཏོག་དྲི་ཞིམ་པ་དཀར་པོ་ལ་རྩ་བའི་སྔགས་བཟླས་ཏེ། དཀྱིལ་འཁོར་དེ་ཐམས་ཅད་དུ་ཆལ་པར་དགྲམ་པར་བྱའོ། །
en: Then the maṇḍala master, rising up in order to listen to the Dharma, should strew white flowers of nice fragrance mixed with sandalwood, camphor, and saffron all over the maṇḍala while reciting the root mantra.

source: མངོན་པར་བཀྲམ་པ་བྱས་ནས་ཕྱི་རོལ་ཏུ་བྱུང་སྟེ།
en: Having thus bestrewn it, he should exit the maṇḍala. {2.129}

source: ཞག་བདུན་གྱི་བར་དུ་འདོད་པའི་ཁ་ཟས་བསྟེན་པའི་རི་མོ་མཁན་གཉིས་སམ་གསུམ་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་གསོ་སྦྱོང་ཉེ་བར་བསྟེན་པ་མཁས་པ་དག་བཅུག་སྟེ།
en: “After seven days, he should bring in two or three highly skilled painters of sacred images—ones who rely on sacrificial food, give rise to bodhicitta, and follow the prescribed observances and fasts.

source: རྩ་བའི་སྔགས་ཀྱིས་གཙུག་ཕུད་བཅིང་བ་བྱས་ལ།
en: The master should tie their hair into topknots while reciting the root mantra.

source: དེ་ནས་གསེར་དང་དངུལ་དང་ཟངས་དང་རིན་པོ་ཆེ་རྣམ་པ་སྣ་ཚོགས་ལས་ཚོན་སྣ་ལྔ་ཤིན་ཏུ་མཛེས་པ་ཡིད་དུ་འོང་བའི་ཕྱེ་མ་ཞིབ་མོ་རབ་ཏུ་བླངས་ཏེ་ལོངས་སྤྱོད་ཆེན་པོ་དང་ལྡན་པ་དང་ཆོས་དང་ལྡན་པའི་རྒྱལ་པོ་དག་འདྲིར་གཞུག་པ་བྱས་ན
en: Then, after obtaining nice and finely ground powder in five vivid colors and made from gold, silver, and various shining jewels, the master should request some great kings who follow the Dharma, very wealthy and pure, to commission the painters to do the main drawing, one which has awakening for its goal and invariably leads to such. {2.130}

source: དཀྱིལ་འཁོར་མཐོང་བ་ཙམ་གྱིས་ངེས་པར་བྱང་ཆུབ་འཐོབ་པ་ཡིན་ན། །སྔགས་སྒྲུབ་པར་བྱེད་པ་ལྟ་སྨོས་ཀྱང་ཅི་དགོས།
en: “One attains this goal of awakening through merely seeing the maṇḍala— What need is there then to speak of its bringing about the accomplishment of the mantra?

source: ཤཱཀྱའི་སྐྱེས་མཆོག་འདས་གྱུར་ནས། །སེམས་ཅན་བསོད་ནམས་ཆུང་བ་ལ། །འདི་འདྲའི་ལོངས་སྤྱོད་ག་ལ་ཡོད། །
en: After the best of the Śākyas has reached nirvāṇa, And at a time when beings have but little merit, How could such a boon be found?

source: དེ་བས་ཆོ་ག་འདི་བསྟན་བྱ། །
en: But yet this rite is now being taught. {2.131}

source: འཇམ་དབྱངས་འོད་ཆེན་ལྡན་པ་ཡིས། །སྐྱེ་བོ་ཕོངས་པར་གཟིགས་ནས་ནི། །ཉུང་ཞིང་དཀྱིལ་བསྡུས་དཀྱིལ་འཁོར་ནི། །མདོར་བསྡུས་ནས་ནི་བསྟན་པ་ཡིན། །
en: “Seeing the misery of poor humanity, Mañjughoṣa, great in splendor, Will now briefly teach the maṇḍala With a summary of its ritual. {2.132}

source: འབྲས་སཱ་ལུ་དང་ཐུག་པོ་ཆེའི་ཕྱེ་མ་ཤིན་ཏུ་ཞིབ་པའི་ཚོན་སྣ་ལྔ་བཟང་པོ། དཀར་བ་དང་སེར་བ་དང་དམར་བ་དང་ནག་པོ་དང་ལྗང་གུ་དག་གིས་བསྒྱུར་ཏེ།
en: “One should color the maṇḍala Using finely ground rice grains, Brightly dyed in five colors— White, yellow, red, dark blue, and green. {2.133}

source: སྔར་བཞག་པའི་ཚོན་གྱི་ཕྱེ་མ་སློབ་དཔོན་རང་གིས་བླངས་ནས། གཙུག་ཕུད་ལྔའི་ཕྱག་རྒྱ་ཆེན་པོ་བཅིངས་ཏེ། རྩ་བའི་སྔགས་ཀྱི་བཟླས་པ་བྱས་ནས་ཕྱེ་མ་དེ་ལ་ཕྱག་རྒྱ་བཅིང་ངོ་། །
en: “The maṇḍala master should take up the previously prepared powder, form the great five-crested mudrā, and seal the powder with it while reciting the root mantra.

source: སྒྲུབ་པའི་གྲོགས་མཆོག་གི་སློབ་དཔོན་གྱིས་དཀྱིལ་འཁོར་གྱི་ཕྱི་རོལ་ཤར་ལྷོ་མཚམས་ཀྱི་ཕྱོགས་སུ་ཆོ་ག་མཐོང་བའི་ལས་ཀྱིས་ཐབ་ཁུང་བྱ་སྟེ།
en: He should have the second officiating master dig a fire pit outside of the maṇḍala to the southeast, following the prescribed ritual.

source: རྒྱར་ཁྲུ་དོ་ལ་ཟབས་སུ་ཁྲུ་གང་བ་ཀུན་ནས་འཁོར་བར་པདྨའི་ཟེ་བ་འདྲ་བ། ཕྱི་རོལ་ཡང་པདྨའི་ཟེ་བ་འདྲ་བ་ཤིང་པ་ལ་ཤའི་ཡམ་ཤིང་གིས་མེ་སྦར་བར་བྱ། ཤིང་བིལ་བའི་ཡམ་ཤིང་མཐོ་གང་ཙམ་རློན་པ་ལ་
en: The pit should be two cubits across and one cubit deep, its rim with anthers like a lotus flower. {2.134} “A fire should be lit outside using sticks of the bilva tree for firewood and sticks of the dhak tree, as thin as the anthers of a lotus flower, for kindling.

source: ཞོ་དང་སྦྲང་རྩི་དང་། མར་ལ་བཏགས་པ་ལ་རྩ་བའི་སྔགས་འབྲུ་དྲུག་པའམ་སྙིང་པོས་ཁུ་ཚུར་གྱི་ཕྱག་རྒྱ་བཅིངས་ཏེ་མེ་ལྷ་སྤྱན་དྲང་བར་བྱའོ། །
en: The former should be nine inches long, moist with sap, and smeared with curds, honey, and ghee.

source: སྤྱན་དྲངས་ནས་སྔར་བསྟན་པ་ཉིད་ཀྱི་རྩ་བའི་སྔགས་ཡི་གེ་གཅིག་པའི་སྙིང་པོས་ཕྱིར་ཡང་བརྒྱ་རྩ་བརྒྱད་སྦྱིན་སྲེག་བྱའོ། །
en: The officiant should summon the fire deity by reciting the root mantra or the six-syllable heart mantra while forming the mudrā the fist .

source: དེ་ནས་དཀྱིལ་འཁོར་གྱི་སློབ་དཔོན་གྱིས་ཅོད་པན་དང་འཚོག་ཆས་བྱས་ནས་བདག་ཉིད་དང་རི་མོ་མཁན་ཡང་རྩེ་གཅིག་པར་བྱས་ནས་སྦྱིན་སྲེག་བྱེད་དུ་གཞུག་གོ། །
en: Having summoned it, he should use the previously explained single-syllable root mantra or the heart mantra to once again perform one hundred and eight oblations. {2.135}

source: དེ་ནས་དཀྱིལ་འཁོར་གྱི་སློབ་དཔོན་སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཡིད་ལ་བྱས་ཏེ། སྔར་བསྟན་པའི་བདུག་པས་བདུགས་ནས་ཐལ་མོ་སྦྱར་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་རབ་ཏུ་བཏུད་ནས། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་ཡང་
en: “Then the master of the maṇḍala, having tied on a turban and prepared the implements, should himself guide the skilled painters in their work. Thinking of the buddhas and bodhisattvas, he should light incense while saying the same incense mantra as previously specified. Folding his cupped palms together, he should bow to all the buddhas and bodhisattvas, and to Mañjuśrī, the divine youth.

source: ཕྱག་བྱས་ཏེ། ཚོན་གྱི་ཕྱེ་མ་བླངས་ནས་སྐུའི་གཟུགས་ཀྱིས་བཅད་པ་ལ། རི་མོ་མཁན་གྱིས་ཡོངས་སུ་རྫོགས་པར་བྱའོ། །
en: Having thus paid homage, he should fetch the colored powders and let the painters do their work.

source: ཆོ་ག་འདི་དག་གིས་དང་པོར་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་ཉིད་རྣམ་པ་ཐམས་ཅད་ཀྱི་མཆོག་དང་ལྡན་པ། སེང་གེའི་ཁྲི་ལ་བཞུགས་པ་གནས་གཙང་མའི་གཞལ་མེད་ཁང་ན་ཆོས་སྟོན་ཅིང་བཞུགས་པ་བྲི་བར་བྱའོ། །
en: They should fill in with the powders each shape as outlined. Employing this procedure, the maṇḍala master should first supervise the painting of the blessed lord, Buddha Śākyamuni endowed with all the supreme features, sitting on a bejeweled lion throne in the realm of the Pure Abode and teaching the Dharma.

source: དཀྱིལ་འཁོར་གྱི་སློབ་དཔོན་རི་མོ་འདྲི་བ་ན་འདིར་སྒྲུབ་པའི་གྲོགས་མཆོག་གིས་སློབ་དཔོན་བདག་ཉིད་བསྲུང་བའི་ཕྱིར། རྩ་བའི་སྔགས་ཀྱིས་འབྱུང་པོ་ཐམས་ཅད་པའི་གཏོར་མ་གཏང་བར་བྱ་སྟེ།
en: When the image has been created, the assistant to the maṇḍala master should perform self-protection by reciting the root mantra and then offer bali that satisfies all spirits.

source: ཕྱི་རོལ་གྱི་ཕྱོགས་བཞི་དང་སྟེང་དང་འོག་དག་ཏུ་གཏོར་བར་བྱའོ། །
en: He should throw it into the four directions outside of the maṇḍala and also upward and downward. {2.136}

source: དེ་ནས་ཁྲུས་བྱས་ཏེ་ཐབ་ཁུང་དུ་ཉེ་བར་སོང་ནས་གོས་གཙང་མ་བགོས་ཏེ། གཙང་སྦྲ་དང་སྲུང་བའི་ཆོ་ག་བྱས་ནས་གུར་གུམ་དང་བསྲེས་པའི་མར་གྱི་སྦྱིན་སྲེག་སྟོང་རྩ་བརྒྱད་བྱའོ། །
en: “After bathing, ritually pure and wearing clean clothes, he should go to the fire pit and perform the rite of protection and offer one thousand and eight oblations of ghee mixed with saffron while reciting the root mantra.

source: དེ་ནས་ཀུ་ཤའི་ཁྲེས་ལ་འདུག་ནས་བཟླས་པ་བྱ་སྟེ། དེ་ཉིད་དུ་གནས་པར་བྱའོ། །
en: Subsequently, he should sit down on a bundle of kuśa grass and remain there, reciting. {2.137}

source: ཡུངས་ཀར་ལ་ཁྲོ་བོའི་རྒྱལ་པོ་གཤིན་རྗེ་གཤེད་ཀྱི་སྔགས་བརྒྱ་རྩ་བརྒྱད་ཀྱིས་མངོན་པར་བསྔགས་ལ་ཁམ་ཕོར་ཁ་སྦྱར་གྱི་ནང་དུ་གཞག་པར་བྱའོ། །
en: “He should incant white mustard seeds one hundred and eight times with Yamāntaka, the Lord of Wrath , and place them between two earthenware bowls.

source: བགེགས་ཀྱི་རྣམ་པ་འཇིགས་སུ་རུང་བའི་གཟུགས་ཅན་མི་བཟད་པའི་སྒྲ་རྣམ་པ་དུ་མ་རླུང་དང་ཆར་དང་ཡུལ་ངན་གཞན་དང་གཞན་གང་གི་ཡང་རུང་བ་མཐོང་ན། ཁྲོས་པས་ཡུངས་ཀར་ཁམ་ཕོར་ནས་ཕྱུང་ལ་ཆང་པར་བཅངས་ཏེ་ལན་བདུན་སྦྱིན་སྲེག་བྱས་པ་དེས་ནི་བགེགས་རབ་ཏུ་འཇོམས་པར་འགྱུར་རོ། །
en: If an obstacle maker is perceived in any form, be it a misshapen figure, a terrible sound, wind, rain, bad weather, or any other form, the assistant should, in a wrathful state of mind, offer seven mustard seed oblations. The obstacles will then vanish.

source: མིའི་བགེགས་ལ་ནི་ལན་ལྔ་ཆང་པ་ནས་སྦྱིན་སྲེག་བྱས་ན་
en: If the obstacle makers are human , he should offer five oblations.

source: སྐྱེས་བུ་དེ་རེངས་པར་འགྱུར་བའམ། ནུས་པ་མེད་པར་འགྱུར་བའམ། འཆི་བར་འགྱུར་བའམ། སྐད་ཅིག་དེ་ཉིད་ལ་མི་མ་ཡིན་པས་ཟིན་པར་འགྱུར་བ་ལ་ནམས་ཀྱང་ཐེ་ཚོམ་མེད་དེ
en: They will become paralyzed, lose their strength, and die or will immediately be seized by nonhuman beings. There is no doubt about this.

source: བརྒྱ་བྱིན་ཡང་འཆི་བར་བྱེད་ན་མ་རུངས་བའི་སེམས་དང་ལྡན་པའི་མིའམ། བགེགས་ཐ་མལ་པ་ལྟ་སྨོས་ཀྱང་ཅི་དགོས།
en: Even Śakra would die swiftly, let alone human beings with wicked minds or other obstacle makers.

source: ཁྲོ་བོ་གཤིན་རྗེ་གཤེད་ཀྱི་འཇིགས་པས་བགེགས་རྣམས་ཕན་ཚུན་དུ་འབྲོས་ཤིང་མི་སྣང་བར་འགྱུར་རོ། །
en: Seized by the fear of Yamāntaka, the Lord of Wrath , they will disappear, fleeing in all directions. {2.138}

source: དེ་ནས་སྒྲུབ་པའི་གྲོགས་མཆོག་གིས་དེ་ཉིད་དུ་ཀུ་ཤའི་ཁྲེས་ལ་གནས་ནས་ཁྲོ་བོའི་རྒྱལ་པོ་གཤིན་རྗེ་གཤེད་ཀྱི་བཟླས་པ་བྱེད་ཅིང་གནས་པར་བྱའོ། །
en: “The assistant should remain seated at the same place, on a bundle of kuśa grass, and keep reciting Yamāntaka, the Lord of Wrath .

source: དེ་ནས་དཀྱིལ་འཁོར་གྱི་སློབ་དཔོན་གྱིས་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པའི་སྐུ་གཟུགས་ཀྱི་གཡས་ངོས་སུ། རང་སངས་རྒྱས་ཉིད་པདྨའི་གདན་ལ་བཞུགས་པར་བྱའོ། །
en: The master of the maṇḍala should then let the painters execute the painting of two pratyeka­buddhas, sitting in a cross-legged posture on lotus seats to the right of the painting of Lord Śākyamuni.

source: དེ་གཉིས་ཀྱི་འོག་ཏུ་ཉན་ཐོས་ཆེན་པོ་གཉིས་ཆོས་ཉན་པར་བྱའོ། །
en: Below the pratyeka­buddhas, two great śrāvakas listening to the Dharma discourse should be painted. {2.139}

source: དེ་དག་གི་ཡང་གཡས་སུ་བཅོམ་ལྡན་འདས་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ། སྟོན་ཀའི་འདམ་བུའི་མདོག་ལྟར་དཀར་བ། པདྨའི་གདན་ལ་བཞུགས་པ། ཕྱག་གཡོན་པ་ན་པདྨ་བསྣམས་པ། ཕྱག་གཡས་པ་ན་མཆོག་སྦྱིན་པ།
en: “To the right of them, there should be the blessed lord, the noble Avalokiteśvara, adorned with every ornament, white as the autumn moon, sitting on a lotus seat, holding a lotus with his left hand and making a boon-granting gesture with his right.

source: དེའི་ཡང་གཡས་ན་བཅོམ་ལྡན་འདས་མ་ཡུམ་གོས་དཀར་མོ་ཕྱག་གཡོན་པ་ན་པདྨ་བསྣམས་པ། ཕྱག་གཡས་པས་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་ལ་ཕྱག་འཚལ་བ་པདྨའི་གདན་ལ་བཞུགས་པ་གསེར་གྱི་ཅོད་པན་འཆང་བ་དར་ལ་དཀར་པོའི་ན་བཟའ་མནབས་པ། ཐལ་བ་ནག་པོས་ཐིག་ལེ་གསུམ་བྱས་པ་དེ་བཞིན་དུ་སྒྲོལ་མ་དང་། ཁྲོ་གཉེར་ཅན་ཡང་རང་རང་གི་གནས་སུ་སྤྱོད་ལམ་དག་གིས་གནས་པར་བྱའོ། །
en: To the right of him, again, there should be the blessed Pāṇḍaravāsinī, holding a lotus with her left hand and saluting Lord Śākyamuni with her right, sitting on a lotus seat, and wearing a diadem on her hair tied in a topknot, a turban of white silk, white garments, and a tightly fitting silken bodice. She should be painted with three dots made of black ash. Tārā and Bhṛkuṭī should be depicted in a similar way, sitting on their respective seats and displaying their specific postures.

source: དེ་དག་གི་སྟེང་དུ་ནི་བཅོམ་ལྡན་འདས་ཡུམ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་མ་དང་། དེ་བཞིན་གཤེགས་པའི་སྤྱན་དང་གཙུག་ཏོར་གྱི་རྒྱལ་མོ་རྣམས་བྱའོ། །
en: Above them are the blessed Prajñāpāramitā, Tathāgata­locanā , and Uṣṇīṣarājñī. {2.140}

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་བཅུ་དྲུག་བྱ་བ་ལ་འདི་ལྟ་སྟེ།
en: “The sixteen bodhisattvas should also be included:

source: ཀུན་ཏུ་བཟང་པོ་དང་། སའི་སྙིང་པོ་དང་། ནམ་མཁའ་མཛོད་དང་། སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བ་དང་། ངན་སོང་རྣམ་པར་སྦྱོང་བ་དང་། བྱམས་པ་རྔ་ཡབ་ལག་ན་ཐོགས་ཤིང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་བལྟ་བ་དང་། དྲི་མ་མེད་པར་འགྲོ་བ་དང་། དྲི་མ་མེད་པའི་ཏོག་དང་། ནོར་བཟང་དང་། ཟླ་བའི་འོད་དང་། དྲི་མ་མེད་པར་གྲགས་པ་དང་། ནད་ཐམས་ཅད་གསོ་བར་བྱེད་པ་དང་། ཆོས་ཐམས་ཅད་ཀྱི་དབང་ཕྱུག་གི་རྒྱལ་པོ་དང་། འཇིག་རྟེན་འགྲོ་བ་དང་། བློ་ཆེན་པོ་དང་། བློ་བཟང་པོ་སྟེ།
en: Samantabhadra; Kṣitigarbha; Gaganagañja; Sarva­nīvaraṇa­viṣkambhin; Apāyajaha; Maitreya with yak-tail whisk in his hand and looking at the Blessed Buddha; Vimalamati; Vimalaketu; Sudhana; Candraprabha; Vimalakīrti; Bhaiṣajyarāja; Sarva­dharmīśvara­rāja; Lokagati; Mahāmati; and Patidhara.

source: སེམས་དཔའ་ཆེན་པོ་འདི་དག་ནི་ལུས་ཤིན་ཏུ་ཞི་བ་དང་རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ་བྲི་བར་བྱའོ། །
en: Each of these sixteen great bodhisattvas should be depicted in a peaceful form adorned with all types of jewelry. {2.141}

source: རིག་པའི་རྒྱལ་པོའི་གཙོ་བོ་དང་། རིག་པའི་རྒྱལ་མོ་དང་པདྨའི་རིགས་གཟུགས་དང་ཕྱག་རྒྱ་ལུང་ཅི་ལྟ་བ་བཞིན་དུ་གནས་ཅི་ལྟ་བ་མ་ལུས་པ་དག་ཏུ་བྲི་བར་བྱའོ། །
en: “The chief vidyārāja s and vidyārājñīs should all be painted in the forms and postures of the Lotus family as passed down by the tradition or described in scriptures and arranged in their respective places.

source: མཐའི་གྲུ་བཞིའི་གནས་དག་ཏུ་ནི་གནས་རྣམས་གཞག་པར་བྱའོ། །
en: On the periphery, a four-sided area should be designated

source: པདྨའི་མེ་ཏོག་ལེགས་པར་བྱས་པ་དང་རིག་པའི་ལྷ་གང་དྲན་པ་ཡང་དེ་དག་ཏུ་གཞག་པར་བྱའོ། །
en: and strewn with lotus flowers; in this should be included whatever other vidyā deities one can think of. {2.142}

source: དེ་བཞིན་དུ་ལྷོ་ཕྱོགས་སུ་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་དང་རང་སངས་རྒྱས་གཉིས་ནི། རི་སྤོས་ཀྱི་ངད་ལྡང་བ་ལ་བཞུགས་པ་བྲི་བར་བྱའོ། །
en: “The two pratyeka­buddhas on the right side of Lord Śākyamuni, as mentioned above, are Gandhamādana and Upāriṣṭa.

source: དེ་བཞིན་དུ་དཀྱིལ་འཁོར་ཀྱི་ཤར་དུ་བདག་ཉིད་བལྟ་བ་དང་། ཐམས་ཅད་ལ་ཡང་འཇུག་པའི་སྒོ་རྣམས་བྱའོ། །
en: The maṇḍala, facing east, should have entry gates painted on all sides.

source: བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པའི་གཡོན་གྱི་ཕྱོགས་སུ་རང་སངས་རྒྱས་གཞན་གཉིས་ཏེ། ཙནྡན་དང་གྲུབ་པ་ཞེས་བྱ་བ་གཉིས་བྲི་བར་བྱའོ། །
en: On the left side of Lord Śākyamuni should be the other two pratyeka­buddhas, Candana and Siddha .

source: དེ་གཉིས་ཀྱི་འོག་ཏུ་ཉན་ཐོས་གཉིས་ནི་འོད་སྲུང་ཆེན་པོ་དང་ཀཱ་ཏྱཱ་ཡ་ན་ཆེན་པོ་བྲི་བར་བྱའོ། །
en: Below them should be the two great śrāvakas, Mahākāśyapa and Mahākātyāyana. {2.143}

source: དེ་དག་གིའང་གཡོན་དུ་འཕགས་པ་ཕྱག་ན་རྡོ་རྗེ་ཨུཏྤ་ལ་ལྟར་མདོག་སྔོ་བསངས་གཟུགས་ཤིན་ཏུ་མཛེས་པ་རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ།
en: “To their left is the noble Vajrapāṇi in his peaceful form, dark blue like a water lily, adorned with all types of jewelry.

source: ལག་པ་གཡས་པ་ན་རྔ་ཡབ་ཐོགས་པ།
en: He holds a fly-whisk in his right hand;
